<?php

//variables.php
//Глобальные переменные

	//Массив с месяцами
	$monthsName = array(
		'01' => 'Январь',
		'02' => 'Февраль',
		'03' => 'Март',
		'04' => 'Апрель',
		'05' => 'Май',
		'06' => 'Июнь',
		'07' => 'Июль',
		'08' => 'Август',
		'09' => 'Сентябрь',
		'10' => 'Октябрь',
		'11' => 'Ноябрь',
		'12' => 'Декабрь'
	);

	//Для напоминаний
    $for_notes = array (
        1 => 'Каласепт, Метапекс, Септомиксин (Эндосольф)',
        2 => 'Временная пломба',
        3 => 'Открытый зуб',
        4 => 'Депульпин',
        5 => 'Распломбирован под вкладку (вкладка)',
        6 => 'Имплантация (ФДМ ,  абатмент, временная коронка на импланте)',
        7 => 'Временная коронка',
        10 => 'Установлены брекеты',
        8 => 'Санированные пациенты ( поддерживающее лечение через 6 мес)',
        9 => 'Прочее',
    );

    //Массив с днями недели
    $dayWeek_arr = array(
        1 => 'ПН',
        2 => 'ВТ',
        3 => 'СР',
        4 => 'ЧТ',
        5 => 'ПТ',
        6 => 'СБ',
        0 => 'ВС',
    );

    //Массив тех, кому видно заявку (тикет) по умолчанию
    //$permissionsWhoCanSee_arr = array(2, 3, 8, 9);
	
?>